[
  {
    "id": "greyautomotive.ng",
    "slug": "greyautomotive-ng",
    "title": "Grey Automotive — Travel & Courier",
    "clip": "A modern website for a new age automotive company in Nigeria, showcasing their services.",
    "images": [
      {
        "url": "/images/work/greyautomotive.ng-mac.png",
        "width": 6000,
        "height": 4000,
        "alt": "Grey Automotive landing page on a Macbook"
      },
      {
        "url": "/images/work/greyautomotive.ng-services.png",
        "width": 4000,
        "height": 2405,
        "alt": "Grey Automotive services section"
      },
      {
        "url": "/images/work/greyautomotive.ng-about.png",
        "width": 4000,
        "height": 2405,
        "alt": "Grey Automotive about us page"
      },
      {
        "url": "/images/work/greyautomotive.ng-why-grey.png",
        "width": 4000,
        "height": 2405,
        "alt": "Grey Automotive why choose us section"
      },
      {
        "url": "/images/work/greyautomotive.ng-contact-us.png",
        "width": 4000,
        "height": 2405,
        "alt": "Grey Automotive contact us section"
      },
      {
        "url": "/images/work/greyautomotive.ng-booking.png",
        "width": 4000,
        "height": 2405,
        "alt": "Grey Automotive Skulbus booking page"
      }
    ],
    "tool": "Transit & Courier | Website",
    "service": "UI/UX Design&nbsp;&nbsp;|&nbsp;&nbsp;Web Engineering",
    "problem": "Grey Automotive, a new age automotive company on the Nigerian transit scene, faced the challenge of establishing a strong online presence to effectively showcase their services and reach a broader audience. Without a modern, user-friendly website, potential customers struggled to access information about their offerings, leading to missed opportunities for growth and customer engagement.",
    "steps": {
      "research": "Conducting comprehensive research was essential to create a website that reflects Grey Automotive's commitment to reliable, efficient transportation and appeals to their diverse customer base. We analysed the Nigerian transportation and logistics market, examining competitor websites to gain insights into industry standards and identify opportunities to differentiate Grey's online presence. By understanding what competitors do well—and where they fall short—we positioned the website to stand out as a leader in the transit and courier sector.\n\nWe conducted in-depth research into Grey's diverse target audiences, including corporate organizations, professionals, students, and event organizers, focusing on their preferences, booking behaviors, and pain points. This allowed us to craft a website experience that speaks directly to users seeking convenient, safe, and dependable transportation solutions. We immersed ourselves in Grey Automotive's brand story, born from a passion for making transport effective, efficient, and dynamic. By capturing the essence of their commitment to quality service, we created a platform that highlights their unique value propositions across multiple service lines.\n\nWe performed usability studies to understand user needs when booking transportation services online. These insights informed the design and functionality, ensuring the website delivers an intuitive booking experience that builds trust and makes it easy for customers to select and pay for their preferred service.",
      "design": "Designing the interface and interactions for Grey Automotive's website centred on creating a clean, professional, and user-centric experience that reflects the brand's commitment to reliability and efficiency. We crafted a streamlined interface that prioritizes ease of navigation, allowing users to quickly find and book their preferred transportation service—whether transit, logistics, student transport, or bus rentals.\n\nThe design employs a modern, professional aesthetic with high-quality imagery showcasing their fleet and services in action. A carefully selected color palette of greys and accent colors reinforces brand identity while maintaining a contemporary, trustworthy appearance. Every design decision focused on reducing friction in the booking journey. We created clear service categorization with distinct visual identities for Transit by Grey, Skulbus, Bus Rentals, and Senda by Grey, making it easy for users to identify their needed service at a glance.\n\nThe booking interface was designed with transparency and simplicity in mind—displaying clear pricing, vehicle availability, departure times, and route information upfront. Interactive elements such as date pickers, location selectors, and trip cards were crafted to make the reservation process intuitive and reassuring. We optimized the design for responsiveness, ensuring the website delivers a seamless booking experience across all devices, from desktop computers to mobile phones used by commuters on the go.",
      "development": "Developing Grey Automotive's website focused on delivering a robust, high-performance platform capable of handling real-time bookings and multiple service offerings simultaneously. We built the website using modern web technologies including Next.js and React, ensuring responsive architecture that delivers a flawless experience across all devices and screen sizes. Performance optimization was critical—we implemented efficient code splitting, lazy loading, and asset optimization to ensure fast load times even on mobile networks.\n\nThe booking system was engineered with reliability and scalability in mind. We developed dynamic search functionality that queries available vehicles, routes, and departure times in real-time, displaying accurate pricing and availability to users. The system seamlessly handles multiple service categories—from corporate transit to student transportation—each with unique booking requirements and business logic. Interactive features such as form validation, date selection, and trip filtering were carefully implemented to create a smooth, error-free booking experience.\n\nWe integrated secure payment processing systems to handle transactions safely, giving users confidence when booking their transportation services. The platform was built with scalability to accommodate Grey's growing service offerings and expanding customer base. Clean, modular code architecture allows for easy updates, new feature integration, and service expansion as the business evolves. We implemented comprehensive error handling and loading states to keep users informed throughout their booking journey. Accessibility standards were prioritized throughout development, ensuring the platform is usable by all customers regardless of ability, meeting WCAG guidelines for an inclusive digital experience."
    },
    "releaseDate": "June, 2024"
  },
  {
    "id": "dev.ochuko.space",
    "slug": "dev-ochuko-space",
    "title": "Ochuko 'Folio 24 — Creative Engineer",
    "clip": "A personal portfolio for a creative engineer. A place to showcase his work and tell his story.",
    "images": [
      {
        "url": "/images/work/ochuko-space-mac.png",
        "width": 4500,
        "height": 2531,
        "alt": "Ochuko's Portfolio on a Macbook"
      },
      {
        "url": "/images/work/ochuko-space-iphone.png",
        "width": 4000,
        "height": 2250,
        "alt": "Ochuko's Portfolio on an iPhone"
      },
      {
        "url": "/images/work/ochuko-space-header.png",
        "width": 4000,
        "height": 2250,
        "alt": "Ochuko's Portfolio header section"
      },
      {
        "url": "/images/work/ochuko-space-transition.png",
        "width": 4000,
        "height": 2250,
        "alt": "Ochuko's Portfolio header to about transition"
      },
      {
        "url": "/images/work/ochuko-space-projects.png",
        "width": 4000,
        "height": 2250,
        "alt": "Ochuko's Portfolio projects section"
      },
      {
        "url": "/images/work/ochuko-space-writings.png",
        "width": 4000,
        "height": 2250,
        "alt": "Ochuko's Portfolio writing section"
      },
      {
        "url": "/images/work/ochuko-space-footer.png",
        "width": 4000,
        "height": 2250,
        "alt": "Ochuko's Portfolio footer section"
      },
      {
        "url": "/images/work/ochuko-space-loading.png",
        "width": 4000,
        "height": 2250,
        "alt": "Ochuko's Portfolio loading screen"
      }
    ],
    "tool": "Creative | Engineer | Portfolio",
    "service": "Web Engineering&nbsp;&nbsp;|&nbsp;&nbsp;Brand Identity",
    "problem": "A creative engineer faces the challenge of effectively communicating their unique blend of technical expertise and artistic innovation in a way that resonates with diverse audiences, including potential clients, collaborators, and employers. Without a strong personal brand or a visually compelling, user-friendly website, their professional identity may remain unclear, and opportunities to showcase their skills could be missed.",
    "steps": {
      "research": "Conducting thorough research is essential to create a website that authentically represents a creative engineer's unique blend of technical expertise and artistic innovation. \n\nWe identified target audiences, such as potential clients, collaborators, and employers, to understand their needs, preferences, and expectations. We also examined websites of similar professionals to identify effective design elements, content strategies, and gaps to differentiate the brand. Our engagement with the Ochuko also helped uncover his professional values, personality, and vision, ensuring the website reflects his authentic voice. Lastly we gathered data on user behaviour and preferences to prioritize intuitive navigation, accessibility, and an engaging user experience. \n\nThis research lays the foundation for a website that not only showcases the engineer's skills but also connects meaningfully with the intended audience.",
      "design": "Designing the interface and interactions for a creative engineer's website focuses on blending functionality with creativity to reflect their unique identity. \n\nWe crafted an intuitive interface that ensures seamless navigation, guiding visitors to key information effortlessly. We used dynamic visuals, animations, and interactive elements to showcase the engineer's projects, processes, and personality in an engaging way. We also incorporated consistent color schemes, typography, and design elements that align with the engineer's personal brand. We ensured the website delivers an optimized experience across devices, from desktops to smartphones and added thoughtful interactions—such as hover effects, project filters, or animated transitions—that enhance user engagement without overwhelming functionality. \n\nThe result is an interface that communicates innovation, invites exploration, and leaves a lasting impression on visitors.",
      "development": "Developing the interface and interactions for the creative engineer's website requires a meticulous approach to ensure the design vision is translated into a seamless, functional experience. \n\nWe utilised modern front-end technologies — React, Next.js, TailwindCSS — as well as asset optimisations to allow for fast load times and rendering speeds. We also integrated ReactThreeFibre and ThreeJS to work with the 3D elements utilised in the website to ensure smoothness on all types of devices. We added engaging interactions, such as hover effects, animations, and dynamic content displays, to make the website more immersive and user-friendly. \n\nTo ensure consistent behaviour and interaction we implemented strong coding practices and vigorous testing. We also worked with clean, modular code to allow for easy updates, scalability, and integration of new features; and we adhered to web accessibility guidelines (e.g., WCAG) to make the website inclusive for all users. \n\nThis development process ensures a polished, interactive website that aligns with the engineer's creative and technical prowess while delivering an exceptional user experience."
    },
    "releaseDate": "January, 2024"
  }
]
